eisup_2019_docmng_integration/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ВидПодразделения</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЯвляетсяДирекцией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЯвляетсяДепартаментом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодИСУЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтноситсяКФинСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипПодразделенияОрганизации</name>
    <type>
      <types>EnumRef.абс_ТипыПодразделенийОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КатегорияПодразделения</name>
    <type>
      <types>EnumRef.абс_КатегорияПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Блок</name>
    <type>
      <types>CatalogRef.абс_Блоки</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалитьабс_Ответственные</name>
    <attributes>
      <name>ОтветственныйСотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/ПодразделенияОрганизаций/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Параметры.СтрокаПоиска) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 51
		|	ПодразделенияОрганизаций.Наименование,
		|	ПодразделенияОрганизаций.Ссылка,
		|	ПодразделенияОрганизаций.абс_КодИСУЗК КАК Код
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Наименование ПОДОБНО &Наименование
		|	И ПодразделенияОрганизаций.абс_Используется";
		
		Запрос.УстановитьПараметр("Наименование", Параметры.СтрокаПоиска+ "%");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Количество = Выборка.Количество();
		
		Если Количество < 51 Тогда
			
			Значение = Новый СписокЗначений;
			Пока Выборка.Следующий() Цикл
				Значение.Добавить(Выборка.Ссылка, Выборка.Наименование + " (" + СокрЛП(Выборка.Код) + ")");
			КонецЦикла;
			
			СтандартнаяОбработка = Ложь;
			ДанныеВыбора = Значение;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
